insert header

# Title

## Business Understanding and Business Problem

### Cost of Errors

## Data Understanding

In [25]:
#imports grabbed from lecture
from random import gauss as gs, uniform as uni, seed
import numpy as np
import pandas as pd
from sklearn.linear_model import LinearRegression
from surprise import Reader, Dataset

from surprise.model_selection import cross_validate
from surprise.prediction_algorithms import SVD
from surprise.prediction_algorithms import KNNWithMeans, KNNBasic, KNNBaseline
from surprise.model_selection import GridSearchCV

### Initial Data

In [26]:
#the four csv files provided
links_df = pd.read_csv('data/links.csv')
movies_df = pd.read_csv('data/movies.csv')
ratings_df = pd.read_csv('data/ratings.csv')
tags_df = pd.read_csv('data/tags.csv')

In [27]:
links_df.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [28]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [29]:
ratings_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [30]:
tags_df.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

## Exploratory Data Analysis

In [31]:
simple_ratings_df = ratings_df.drop('timestamp', axis=1)

In [32]:
simple_ratings_df.head(5)

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [33]:
simple_ratings_df.info(), simple_ratings_df.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   userId   100836 non-null  int64
 1   movieId  100836 non-null  int64
 2   rating   100836 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 2.3 MB

(None,
 userId     0
 movieId    0
 rating     0
 dtype: int64)

In [34]:
# reader = Reader()
# data = Dataset.load_from_df(simple_ratings_df,reader)

In [35]:
# dataset = data.build_full_trainset()
# print('Number of users: ', dataset.n_users, '\n')
# print('Number of items: ', dataset.n_items)

## Modeling

In [36]:
# params = {'n_factors': [20, 50, 100],
#          'reg_all': [0.02, 0.05, 0.1]}
# g_s_svd = GridSearchCV(SVD,param_grid=params,n_jobs=-1)
# g_s_svd.fit(data)

In [37]:
# print(g_s_svd.best_score)
# print(g_s_svd.best_params)

In [38]:
# # cross validating with KNNBasic
# knn_basic = KNNBasic(sim_options={'name':'pearson', 'user_based':True})
# cv_knn_basic = cross_validate(knn_basic, data, n_jobs=-1)

In [39]:

# for i in cv_knn_basic.items():
#     print(i)
# print('-----------------------')
# print(np.mean(cv_knn_basic['test_rmse']))

In [40]:
# # cross validating with KNNBaseline
# knn_baseline = KNNBaseline(sim_options={'name':'pearson', 'user_based':True})
# cv_knn_baseline = cross_validate(knn_baseline,data)

In [41]:
# for i in cv_knn_baseline.items():
#     print(i)

# np.mean(cv_knn_baseline['test_rmse'])

## SPLIT GENRE

In [42]:
movies_df.head(1)

   movieId             title                                       genres
0        1  Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy

In [43]:
genres_df = movies_df[['movieId', 'genres']]
genres_df.head(1)

   movieId                                       genres
0        1  Adventure|Animation|Children|Comedy|Fantasy

In [44]:
genres_df['genres'][0].split('|')

['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy']

In [45]:
genres_df['genres'][0]

'Adventure|Animation|Children|Comedy|Fantasy'

In [46]:

# # Split single column into two columns use apply()
# df[['First Name', 'Last Name']] = df["Student_details"].apply(lambda x: pd.Series(str(x).split(",")))
# print(df)

In [48]:
genres_df['split_genres'] = genres_df['genres'].iloc[0:].apply(lambda x: x.lower().split('|'))
genres_df.head()

,movieId,genres,split_genres
0,1,Adventure|Animation|Children|Comedy|Fantasy,"[adventure, animation, children, comedy, fantasy]"
1,2,Adventure|Children|Fantasy,"[adventure, children, fantasy]"
2,3,Comedy|Romance,"[comedy, romance]"
3,4,Comedy|Drama|Romance,"[comedy, drama, romance]"
4,5,Comedy,[comedy]

In [ ]:
# genres_df['genres'] = genres_df['genres'].apply(lambda x: x.split('|'))
# genres_df['genres'].head()

## CLEAN TAGS

In [49]:
tags_df.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [53]:
tags_df['tag_clean'] = tags_df['tag'].iloc[0:].apply(lambda x: x.lower().replace(' ', ''))
tags_df['tag_clean'].head()

0             funny
1    highlyquotable
2       willferrell
3       boxingstory
4               mma
Name: tag_clean, dtype: object

In [54]:
tags_df['tag_clean'].value_counts()

innetflixqueue       131
atmospheric           41
funny                 24
surreal               24
thought-provoking     24
                    ...
freetodownload         1
statue                 1
postmodern             1
indonesia              1
nun                    1
Name: tag_clean, Length: 1471, dtype: int64

## Combining some columns to use

In [56]:
# I can remove timestamp, will join on movieId
ratings_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [57]:
ratings_df_clean = ratings_df.drop('timestamp', axis=1)
ratings_df_clean.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [63]:
#can remove tag, timestamp
tags_df.head()

   userId  movieId              tag   timestamp       tag_clean
0       2    60756            funny  1445714994           funny
1       2    60756  Highly quotable  1445714996  highlyquotable
2       2    60756     will ferrell  1445714992     willferrell
3       2    89774     Boxing story  1445715207     boxingstory
4       2    89774              MMA  1445715200             mma

In [62]:
tags_df_clean = tags_df.drop(['tag', 'timestamp'], axis=1)
tags_df_clean.head()

   userId  movieId       tag_clean
0       2    60756           funny
1       2    60756  highlyquotable
2       2    60756     willferrell
3       2    89774     boxingstory
4       2    89774             mma

In [61]:
# can remove genres
genres_df.head()

,movieId,genres,split_genres
0,1,Adventure|Animation|Children|Comedy|Fantasy,"[adventure, animation, children, comedy, fantasy]"
1,2,Adventure|Children|Fantasy,"[adventure, children, fantasy]"
2,3,Comedy|Romance,"[comedy, romance]"
3,4,Comedy|Drama|Romance,"[comedy, drama, romance]"
4,5,Comedy,[comedy]

In [65]:
genres_df_clean = genres_df.drop('genres', axis=1)
genres_df_clean.head()

   movieId                                       split_genres
0        1  [adventure, animation, children, comedy, fantasy]
1        2                     [adventure, children, fantasy]
2        3                                  [comedy, romance]
3        4                           [comedy, drama, romance]
4        5                                           [comedy]

In [70]:
ratings_df_clean.set_index('movieId')
genres_df_clean.set_index('movieId')

                                              split_genres
movieId
1        [adventure, animation, children, comedy, fantasy]
2                           [adventure, children, fantasy]
3                                        [comedy, romance]
4                                 [comedy, drama, romance]
5                                                 [comedy]
...                                                    ...
193581                [action, animation, comedy, fantasy]
193583                        [animation, comedy, fantasy]
193585                                             [drama]
193587                                 [action, animation]
193609                                            [comedy]

[9742 rows x 1 columns]

In [76]:
#JOINING 
ratings_df_clean.join(genres_df_clean, on='movieId', lsuffix='_l')

        userId  movieId_l  rating  movieId                    split_genres
0            1          1     4.0      2.0  [adventure, children, fantasy]
1            1          3     4.0      4.0        [comedy, drama, romance]
2            1          6     4.0      7.0               [comedy, romance]
3            1         47     5.0     52.0        [comedy, drama, romance]
4            1         50     5.0     55.0                         [drama]
...        ...        ...     ...      ...                             ...
100831     610     166534     4.0      NaN                             NaN
100832     610     168248     5.0      NaN                             NaN
100833     610     168250     5.0      NaN                             NaN
100834     610     168252     5.0      NaN                             NaN
100835     610     170875     3.0      NaN                             NaN

[100836 rows x 5 columns]

## Final Model

## Results/Conclusions

### Further Exploration/Questions